Repository: rezapasalar/invoice-flutter
Catalog: lib/l10n/app_*.arb
Languages: fa

# appName
source: Invoice
fa: فاکتور

source: Language
fa: زبان

source: Select language
fa: انتخاب زبان

source: Switch to system theme
fa: تغییر به حالت سیستم

source: Switch to dark mode
fa: تغییر به حالت شب

source: Switch to light mode
fa: تغییر به حالت روز

# dbError
source: An error occurred in the database.
fa: خطایی در پایگاه داده رخ داده است.

# checkNetwork
source: Check your internet connection.
fa: اتصال به شبکه اینترنت خود را بررسی کنید.

source: I understand
fa: متوجه ام

# emptyData
source: No data found.
fa: داده ای یافت نشد.

source: name
fa: نام

source: Customer name
fa: نام مشتری

source: Category name
fa: نام دسته

source: Product name
fa: نام محصول

source: Discount
fa: تخفیف

source: Cash discount
fa: تخفیف نقدی

source: Volume discount
fa: تخفیف حجمی

source: Discount percent
fa: درصد تخفیف

source: Without discount
fa: بدون تخفیف

source: Address
fa: آدرس

source: Customer address
fa: آدرس مشتری

source: Without address
fa: بدون آدرس

source: Code
fa: کد

source: Product code
fa: کد محصول

# title
source: Product info
fa: مشخصات کالا

source: Quantity in box
fa: تعداد در کارتن

# quantityOfBoxes
source: Number of boxes
fa: تعداد کارتن

source: Price
fa: قیمت

source: Product price
fa: قیمت محصول

source: Price each
fa: فی هر

# formError
source: Error in validating the form.
fa: خطایی در اعتبارسنجی فرم

source: Successful Operation
fa: عملیات موفقیت آمیز

source: Invoice create
fa: ثبت فاکتور

# productCreate
source: Create product
fa: ثبت محصول

# categoryCreate
source: Create category
fa: ثبت دسته

# customerCreate
source: Create customer
fa: ثبت مشتری

source: Invoice edit
fa: ویرایش فاکتور

source: Preinvoice edit
fa: ویرایش پیش فاکتور

source: Invoice delete
fa: حذف فاکتور

# productEdit
source: Edit product
fa: ویرایش محصول

# categoryEdit
source: Edit category
fa: ویرایش دسته

# customerEdit
source: Edit customer
fa: ویرایش مشتری

# requiredField
source: Please fill in field.
fa: لطفا فیلد را پر کنید.

source: Create
fa: ثبت

source: Edit
fa: ویرایش

# fetchDataError
source: Error in data fetch.
fa: خطا در بازیابی دیتا

source: Try again
fa: تلاش مجدد

# areYouSure
source: Are you sure for {subject}?
fa: برای {subject} اطمینان دارید؟

source: Delete
fa: حذف

source: Remove
fa: حذف

source: Remove forever
fa: حذف برای همیشه

source: Yes
fa: بله

source: No
fa: خیر

source: Cancel
fa: انصراف

source: Ok
fa: بله

source: No categories
fa: دسته بندی وجود ندارد.

source: No customers
fa: مشتری وجود ندارد.

# tapAddCategories
source: Tap the Add button to create a category.
fa: برای ایجاد دسته بندی، دکمه افزودن را ضربه بزنید.

# tapAddCustomers
source: Tap the Add button to create a customer.
fa: برای ایجاد مشتری، دکمه افزودن را ضربه بزنید.

source: No products
fa: محصولی وجود ندارد.

# tapAddProducts
source: Tap the Add button to create a product.
fa: برای ایجاد محصول، دکمه افزودن را ضربه بزنید.

source: No invoices
fa: فاکتوری وجود ندارد.

# tapAddInvoice
source: Tap the Add button to create a invoice.
fa: برای ایجاد فاکتور، دکمه افزودن را ضربه بزنید.

# noInvoiceProducts
source: No products
fa: محصولی وجود ندارد.

# tapAddInvoiceProducts
source: Tap the Add button to create a products.
fa: برای ایجاد محصول، دکمه افزودن را ضربه بزنید.

source: Bookmark
fa: نشانه

source: Bookmarks
fa: نشانه ها

source: Selected
fa: انتخاب شده

source: Newest
fa: جدید ترین

source: Oldest
fa: قدیمی ترین

source: Invoice
fa: فاکتور

source: Invoices
fa: فاکتورها

source: Preinvoice
fa: پیش فاکتور

source: New product
fa: محصول جدید

source: Total
fa: جمع کل

source: Payable
fa: قابل پرداخت

source: Rial
fa: ريال

source: Category
fa: دسته

source: Categories
fa: دسته بندی

source: Product category
fa: دسته محصول

# alreadyExisted
source: Such a {subject} already existed.
fa: این {subject} قبلاً وجود داشته است.

source: Product
fa: محصول

source: Products
fa: محصولات

source: Without product
fa: بدون محصول

# descriptionForDeleteCategory
source: By deleting a category, all the products of that category will be deleted, and the invoices whose products have been deleted will also change
fa: با حذف دسته تمامی محصولات آن دسته حذف خواهد شد و همینطور فاکتورهایی که محصولات آن ها حذف شده تغییر میکند

# descriptionForDeleteProduct
source: By removing the product, the invoices that had this product will change
fa: با حذف محصول فاکتورهایی که این محصول را دارا بودند دچار تغییر میشوند

# descriptionForDeleteCustomer
source: By deleting the customer, all the invoices of that customer will be deleted
fa: با حذف مشتری تمامی فاکتورهای آن مشتری حذف خواهد شد

source: Volume
fa: حجم

source: Product volume
fa: حجم محصول

source: Volume unit
fa: واحد حجم

source: Gram
fa: گرم

source: CC
fa: سی سی

# numbers
source: No
fa: عددی

source: New customer
fa: مشتری جدید

source: Registered customer
fa: مشتری ثبت نام شده

source: Phone
fa: تلفن

source: Customers
fa: مشتریان

# discountDescription
source: The discount fields can be empty, which is equivalent to zero or no discount.
fa: فیلدهای تخفیف میتوانند خالی باشند که معادل صفر یا همان بدون تخفیف است.

source: National code
fa: کد ملی

# latestInvoices
source: Last registered or changed invoices
fa: آخرین فاکتورهای ثبت شده یا ویرایش شده

# withoutPreinvoiceOrInvoice
source: Without proinvoice or invoice
fa: بدون پیش فاکتور یا فاکتور

source: Settings
fa: تنظیمات

source: Product information
fa: مشخصات محصول

source: Box
fa: کارتن

source: Search
fa: جستجو

source: No results found
fa: نتیجه ای یافت نشد

source: Backup
fa: پشتیبان گیری

source: Restore
fa: بازیابی داده

source: Download
fa: دانلود

source: Download and share
fa: دانلود و اشتراک

source: Share
fa: اشتراک

# error
source: An error occurred. Please try again.
fa: خطایی رخ داده مجدد تلاش کنید.

# successfulRestore
source: Data restore was successful.
fa: بازیابی داده با موفقیت صورت گرفت.

source: Select file
fa: انتخاب فایل

# backupDescription
source: In this section, you can back up your data to recover this data if needed. Our suggestion is to perform the backup periodically so that in case of an error or the application is deleted, your data will be saved from don't get lost.
fa: در این بخش میتوانید از داده های خود پشتیبان گیری کنید که در صورت نیاز این داده ها را بازیابی کنید, پیشنهاد ما این هست که پشتیبان گیری را به صورت دوره ای انجام دهید تا در صورت بروز خطا یا پاک شدن برنامه داده های شما از بین نرود.

# restoreDescription
source: You can select the files that you saved under the title of backup with the extension of db to restore the data, note that after the data is restored, your current information will be deleted, and if needed, you can back up the current data.
fa: فایل هایی را که تحت عنوان پشتیبان گیری با پسوند db ذخیره کردید را برای بازیابی داده ها انتخاب کنید, توجه داشته باشید که پس از بازیابی داده ها اطلاعات فعلی شما حذف خواهد شد.

# noProduct
source: There is no such product.
fa: چنین محصولی وجود ندارد.

source: Invoice description
fa: توضیحات فاکتور

source: Description
fa: توضیحات

# bookmarked
source: The {subject} has been marked
fa: {subject} نشانه گذاری شد

# unBookmarked
source: {subject} marking was removed
fa: نشانه گذاری {subject} حذف شد

source: No bookmark
fa: نشانه ای وجود ندارد.

# invalidLengthField
source: The number of characters in the field is not correct.
fa: تعداد کاراکتر های فیلد صحیح نیست.

source: Only invoice
fa: فقط فاکتور

# onlyPreinvoic
source: Only preinvoice
fa: فقط پیش فاکتور

source: Official
fa: رسمی

source: Unofficial
fa: غیر رسمی

source: Options
fa: گزینه ها

source: Invoice date
fa: تاریخ فاکتور

source: Invoice number
fa: شماره فاکتور

source: Customer national code
fa: کد ملی مشتری

source: Customer phone
fa: تلفن مشتری

source: Color invoice
fa: فاکتور رنگی

source: Terms of sale
fa: شرایط فروش

source: Invoice hints
fa: نکات فاکتور

source: Signers
fa: امضا کنندگان

source: Details
fa: جزئیات

source: Invoice details
fa: جزئیات فاکتور

source: Customer
fa: مشتری

source: Invoice registration
fa: تاریخ ثبت

source: Date last edit
fa: تاریخ آخرین ویرایش

source: Enter your passcode
fa: گذرواژه خود را وارد کنید

source: Enter passcode
fa: ورود گذرواژه

# enterYourPasscodeDescription
source: Please enter your current password to manage these settings.
fa: لطفا گذرواژه فعلی خود را برای مدیریت این تنظیمات وارد کنید.

# signInTitle
source: Authentication required
fa: احراز هویت لازم است.

# biometricHint
source: Verify identity
fa: تایید هویت

# fingerprintDescription
source: Scan your fingerprint (or face or whatever) to authenticate.
fa: اثر انگشت خود (یا چهره یا هر چیز دیگری) را برای احراز هویت اسکن کنید.

source: Security
fa: امنیت

source: Enable passcode
fa: فعال کردن گذرواژه

# lockWithPasscode
source: Passcode lock
fa: قفل با گذرواژه

# lockWithPasscodeDescription
source: Once a passcode is set, a lock icon will appear on the home screen of your app, Tap to lock the app.
fa: هنگامی که یک گذرواژه تنظیم شود, یک آیکون قفل در صفحه اول برنامه شما ظاهر می شود, برای قفل کردن برنامه روی آن بزنید.

# passcodeDescription
source: Create a {number} digit passcode that you can remember.
fa: یک گذرواژه {number} رقمی ایجاد کنید که بتوانید آن را به خاطر بسپارید.

# createPasscode
source: Create a passcode
fa: ثبت گذرواژه

source: Re-enter your passcode
fa: تکرار گذرواژه

# reEnterYourPasscodeDescription
source: If you forget the passcode, it is not possible to recover it and you have to reinstall the program.
fa: اگر گذرواژه را فراموش کردید، امکان بازیابی آن وجود ندارد و باید برنامه را دوباره نصب کنید.

# noMatchPasscode
source: Passcodes don't match.
fa: گذرواژه‌ها مطابقت ندارند.

source: Lock settings
fa: تنظیمات قفل

source: Change passcode
fa: تغییر گذرواژه

source: New passcode
fa: گذرواژه جدید

# passcodeInvalid
source: The passcode is invalid.
fa: گذرواژه نامعتبر است.

source: Enable
fa: فعال

source: Disable
fa: غیرفعال

source: Disable passcode
fa: غیر فعال کردن گذرواژه

# lockConfigDescription
source: To lock the program, click on the lock icon at the top of the first screen.
fa: برای قفل کردن برنامه, بر روی آیکون قفل در بالای صفحه اول برنامه بزنید.

source: Unlock with fingerprint
fa: باز کردن قفل با اثر انگشت

source: Automatic lock
fa: قفل خودکار

# autoLockDescription
source: If you do not re-enter the program for a certain period of time, you will be asked for a password.
fa: در صورت ورود نکردن مجدد به برنامه به مدت زمان مشخص از شما گذرواژه خواسته می شود.

source: Confirm
fa: تایید

source: Minutes
fa: دقیقه

# hour
source: Houre
fa: ساعت

source: Hours
fa: ساعت

# within
source: In
fa: ظرف

# helperTextforPrice
source: Changes in the price each field are only applied to the current invoice.
fa: تغییر در فیلد فی هر فقط برای فاکتور فعلی اعمال میشود.

source: Too many tries.
fa: دفعات بسیار زیادی امتحان کردید.

# tooManyTriesCornometer
source: please try again in {number} seconds.
fa: لطفا {number} ثانیه دیگر دوباره تلاش کنید.

source: Forgot passcode?
fa: گذرواژه را فراموش کرده اید؟

# forgotPasscodeDescription
source: If you have forgotten your passcode, please delete and reinstall the program, unfortunately your data will be deleted.
fa: اگر گذرواژه را فراموش کرده اید، لطفاً برنامه را حذف و نصب مجدد کنید، متأسفانه داده های شما حذف می شوند.

source: Fake data
fa: داده های فیک
